#### Terraform Format and Style 🖌`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

module.pubsub_scheduled_example.module.pubsub_topic.google_pubsub_topic.topic[0]: Refreshing state... [id=projects/orgpolicy-notifier/topics/orgpolicy-notifier-topic]
random_id.random: Refreshing state... [id=Do8Uvg]
google_organization_iam_custom_role.org_policy_compare_custom_role: Refreshing state... [id=organizations/948721840059/roles/org_policy_compare_cfn]
google_service_account.org_policy_compare_sa: Refreshing state... [id=projects/orgpolicy-notifier/serviceAccounts/org-policy-compare@orgpolicy-notifier.iam.gserviceaccount.com]
module.pubsub_scheduled_example.module.main.null_resource.dependent_files: Refreshing state... [id=6366462742101406435]
module.pubsub_scheduled_example.module.main.data.null_data_source.wait_for_files: Refreshing state...
module.pubsub_scheduled_example.module.main.data.archive_file.main: Refreshing state...
module.pubsub_scheduled_example.module.main.google_storage_bucket.main: Refreshing state... [id=orgpolicy-notifier-cfn-bucket-0e8f14be]
google_storage_bucket.policy_bucket: Refreshing state... [id=orgpolicy-notifier-policy-bucket-0e8f14be]
module.pubsub_scheduled_example.module.main.google_storage_bucket_object.main: Refreshing state... [id=orgpolicy-notifier-cfn-bucket-0e8f14be-ab64fb6711e0c2aaa2b840f058f4dc6c-src.zip]
module.pubsub_scheduled_example.google_cloud_scheduler_job.job[0]: Refreshing state... [id=orgpolicy-notifier-job-0e8f14be]
google_organization_iam_member.org_policy_compare_member: Refreshing state... [id=948721840059/organizations/948721840059/roles/org_policy_compare_cfn/serviceaccount:org-policy-compare@orgpolicy-notifier.iam.gserviceaccount.com]
module.pubsub_scheduled_example.module.main.google_cloudfunctions_function.main: Refreshing state... [id=orgpolicy-notifier/us-central1/orgpolicy-notifier-0e8f14be]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_organization_iam_custom_role.org_policy_compare_custom_role must be replaced
-/+ resource "google_organization_iam_custom_role" "org_policy_compare_custom_role" {
      ~ deleted     = false -> (known after apply)
        description = "IAM role for Cloud Function to Compare Org Policies"
      ~ id          = "organizations/948721840059/roles/org_policy_compare_cfn" -> (known after apply)
      ~ name        = "organizations/948721840059/roles/org_policy_compare_cfn" -> (known after apply)
        org_id      = "948721840059"
        permissions = [
            "orgpolicy.policy.get",
            "resourcemanager.projects.get",
            "resourcemanager.projects.list",
            "secretmanager.secrets.get",
            "secretmanager.versions.access",
            "secretmanager.versions.get",
            "storage.objects.create",
            "storage.objects.delete",
            "storage.objects.get",
            "storage.objects.list",
            "storage.objects.update",
        ]
      ~ role_id     = "org_policy_compare_cfn" -> "org_policy_compare_cfn-prod" # forces replacement
        stage       = "GA"
        title       = "Organization Policy Function Role"
    }

  # google_organization_iam_member.org_policy_compare_member must be replaced
-/+ resource "google_organization_iam_member" "org_policy_compare_member" {
      ~ etag   = "BwWtLvVyRdI=" -> (known after apply)
      ~ id     = "948721840059/organizations/948721840059/roles/org_policy_compare_cfn/serviceaccount:org-policy-compare@orgpolicy-notifier.iam.gserviceaccount.com" -> (known after apply)
      ~ member = "serviceAccount:org-policy-compare@orgpolicy-notifier.iam.gserviceaccount.com" -> (known after apply) # forces replacement
        org_id = "948721840059"
      ~ role   = "organizations/948721840059/roles/org_policy_compare_cfn" -> "organizations/948721840059/roles/org_policy_compare_cfn-prod" # forces replacement
    }

  # google_service_account.org_policy_compare_sa must be replaced
-/+ resource "google_service_account" "org_policy_compare_sa" {
      ~ account_id   = "org-policy-compare" -> "org-policy-compare-prod" # forces replacement
        display_name = "Organization Policy Compare"
      ~ email        = "org-policy-compare@orgpolicy-notifier.iam.gserviceaccount.com" -> (known after apply)
      ~ id           = "projects/orgpolicy-notifier/serviceAccounts/org-policy-compare@orgpolicy-notifier.iam.gserviceaccount.com" -> (known after apply)
      ~ name         = "projects/orgpolicy-notifier/serviceAccounts/org-policy-compare@orgpolicy-notifier.iam.gserviceaccount.com" -> (known after apply)
      ~ project      = "orgpolicy-notifier" -> (known after apply)
      ~ unique_id    = "103210012818076864672" -> (known after apply)
    }

  # google_storage_bucket.policy_bucket must be replaced
-/+ resource "google_storage_bucket" "policy_bucket" {
        bucket_policy_only       = true
      - default_event_based_hold = false -> null
        force_destroy            = true
      ~ id                       = "orgpolicy-notifier-policy-bucket-0e8f14be" -> (known after apply)
      - labels                   = {} -> null
        location                 = "US"
      ~ name                     = "orgpolicy-notifier-policy-bucket-0e8f14be" -> "orgpolicy-notifier-policy-bucket-0e8f14be-prod" # forces replacement
      ~ project                  = "orgpolicy-notifier" -> (known after apply)
      - requester_pays           = false -> null
      ~ self_link                = "https://www.googleapis.com/storage/v1/b/orgpolicy-notifier-policy-bucket-0e8f14be" -> (known after apply)
        storage_class            = "STANDARD"
      ~ url                      = "gs://orgpolicy-notifier-policy-bucket-0e8f14be" -> (known after apply)

        versioning {
            enabled = true
        }
    }

  # module.pubsub_scheduled_example.google_cloud_scheduler_job.job[0] must be replaced
-/+ resource "google_cloud_scheduler_job" "job" {
        description = "Starts Organization Policies check."
      ~ id          = "orgpolicy-notifier-job-0e8f14be" -> (known after apply)
      ~ name        = "orgpolicy-notifier-job-0e8f14be" -> "orgpolicy-notifier-job-0e8f14be-prod" # forces replacement
        project     = "orgpolicy-notifier"
        region      = "us-central1"
        schedule    = "0 * * * *"
        time_zone   = "America/Detroit"

      ~ pubsub_target {
          - attributes = {} -> null
            data       = "U3RhcnRpbmcgQ29tcGFyaXNvbg=="
          ~ topic_name = "projects/orgpolicy-notifier/topics/orgpolicy-notifier-topic" -> "projects/orgpolicy-notifier/topics/orgpolicy-notifier-topic-prod" # forces replacement
        }
    }

  # module.pubsub_scheduled_example.module.main.google_cloudfunctions_function.main must be replaced
-/+ resource "google_cloudfunctions_function" "main" {
        available_memory_mb           = 2048
        description                   = "Compares Org Policies and alerts users."
        entry_point                   = "announce_kickoff"
      ~ environment_variables         = {
            "ACCESS_TOKEN_NAME"        = "twitter_access_token"
            "ACCESS_TOKEN_SECRET_NAME" = "twitter_access_secret"
            "CONSUMER_KEY_NAME"        = "twitter_api_key"
            "CONSUMER_KEY_SECRET_NAME" = "twitter_api_secret"
          + "ENVIRONMENT"              = "prod"
            "FILE_LOCATION"            = "/tmp/policies.txt"
            "ORG_ID"                   = "948721840059"
          ~ "POLICY_BUCKET"            = "orgpolicy-notifier-policy-bucket-0e8f14be" -> "orgpolicy-notifier-policy-bucket-0e8f14be-prod"
            "POLICY_FILE"              = "policies.txt"
            "S_PROJECT"                = "orgpolicy-notifier"
            "S_SLACK_NAME"             = "slack_webhook"
            "S_TOKEN_NAME"             = "github_token"
            "S_VERSION"                = "latest"
        }
      + https_trigger_url             = (known after apply)
      ~ id                            = "orgpolicy-notifier/us-central1/orgpolicy-notifier-0e8f14be" -> (known after apply)
        ingress_settings              = "ALLOW_ALL"
      - labels                        = {} -> null
        max_instances                 = 0
      ~ name                          = "orgpolicy-notifier-0e8f14be" -> "orgpolicy-notifier-0e8f14be-prod" # forces replacement
        project                       = "orgpolicy-notifier"
        region                        = "us-central1"
        runtime                       = "python37"
      ~ service_account_email         = "org-policy-compare@orgpolicy-notifier.iam.gserviceaccount.com" -> (known after apply) # forces replacement
      ~ source_archive_bucket         = "orgpolicy-notifier-cfn-bucket-0e8f14be" -> "orgpolicy-notifier-cfn-bucket-0e8f14be-prod"
      ~ source_archive_object         = "ab64fb6711e0c2aaa2b840f058f4dc6c-src.zip" -> "18a3c753c7841dd7d326bf2c0200bda8-src.zip"
        timeout                       = 60
      + vpc_connector_egress_settings = (known after apply)

      ~ event_trigger {
            event_type = "google.pubsub.topic.publish"
          ~ resource   = "projects/orgpolicy-notifier/topics/orgpolicy-notifier-topic" -> "orgpolicy-notifier-topic-prod"

            failure_policy {
                retry = false
            }
        }
    }

  # module.pubsub_scheduled_example.module.main.google_storage_bucket.main must be replaced
-/+ resource "google_storage_bucket" "main" {
      ~ bucket_policy_only       = false -> (known after apply)
      - default_event_based_hold = false -> null
        force_destroy            = true
      ~ id                       = "orgpolicy-notifier-cfn-bucket-0e8f14be" -> (known after apply)
      - labels                   = {} -> null
        location                 = "US-CENTRAL1"
      ~ name                     = "orgpolicy-notifier-cfn-bucket-0e8f14be" -> "orgpolicy-notifier-cfn-bucket-0e8f14be-prod" # forces replacement
        project                  = "orgpolicy-notifier"
      - requester_pays           = false -> null
      ~ self_link                = "https://www.googleapis.com/storage/v1/b/orgpolicy-notifier-cfn-bucket-0e8f14be" -> (known after apply)
        storage_class            = "REGIONAL"
      ~ url                      = "gs://orgpolicy-notifier-cfn-bucket-0e8f14be" -> (known after apply)
    }

  # module.pubsub_scheduled_example.module.main.google_storage_bucket_object.main must be replaced
-/+ resource "google_storage_bucket_object" "main" {
      ~ bucket              = "orgpolicy-notifier-cfn-bucket-0e8f14be" -> "orgpolicy-notifier-cfn-bucket-0e8f14be-prod" # forces replacement
        content_disposition = "attachment"
        content_encoding    = "gzip"
        content_type        = "application/zip"
      ~ crc32c              = "ygnkNA==" -> (known after apply)
      ~ detect_md5hash      = "q2T7ZxHgwqqiuEDwWPTcbA==" -> "different hash" # forces replacement
      ~ id                  = "orgpolicy-notifier-cfn-bucket-0e8f14be-ab64fb6711e0c2aaa2b840f058f4dc6c-src.zip" -> (known after apply)
      ~ md5hash             = "q2T7ZxHgwqqiuEDwWPTcbA==" -> (known after apply)
      ~ media_link          = "https://www.googleapis.com/download/storage/v1/b/orgpolicy-notifier-cfn-bucket-0e8f14be/o/ab64fb6711e0c2aaa2b840f058f4dc6c-src.zip?generation=1596719604660781&alt=media" -> (known after apply)
      - metadata            = {} -> null
      ~ name                = "ab64fb6711e0c2aaa2b840f058f4dc6c-src.zip" -> "18a3c753c7841dd7d326bf2c0200bda8-src.zip" # forces replacement
      ~ output_name         = "ab64fb6711e0c2aaa2b840f058f4dc6c-src.zip" -> (known after apply)
      ~ self_link           = "https://www.googleapis.com/storage/v1/b/orgpolicy-notifier-cfn-bucket-0e8f14be/o/ab64fb6711e0c2aaa2b840f058f4dc6c-src.zip" -> (known after apply)
        source              = "./src.zip"
      ~ storage_class       = "REGIONAL" -> (known after apply)
    }

  # module.pubsub_scheduled_example.module.pubsub_topic.google_pubsub_topic.topic[0] must be replaced
-/+ resource "google_pubsub_topic" "topic" {
      ~ id      = "projects/orgpolicy-notifier/topics/orgpolicy-notifier-topic" -> (known after apply)
      - labels  = {} -> null
      ~ name    = "orgpolicy-notifier-topic" -> "orgpolicy-notifier-topic-prod" # forces replacement
        project = "orgpolicy-notifier"

      + message_storage_policy {
          + allowed_persistence_regions = (known after apply)
        }
    }

Plan: 9 to add, 0 to change, 9 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```

</details>

*Pusher: @iloveicedgreentea, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform lint and apply`*